{"_id":{"$oid":"5e448dd7092e652035f3d4ee"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"5e45b9a7a86becc380e04d76"},"Title":"The Imaginarium of Doctor Parnassus","Description":"The film follows a travelling theatre troupe whose leader, having made a bet with the devil takes audience members through a magical mirror to explore their imaginations and present them with a choice between self-fulfilling enlightenment or gratifying ignorance.","Genre":{"Name":"Fantasy","Description":"Fantasy films often have an element of magic, myth, wonder, escapism, and the extraordinary."},"Director":{"Name":"Terry Gilliam","Bio":"Terrence Vance Gilliam is an American-born British screenwriter, film director, animator, actor, comedian and former member of the Monty Python comedy troupe.","Birth":"1940-11-22"},"ImagePath":"imaginarium.png","Featured":true}
{"_id":{"$oid":"5e45bfc3a86becc380e04d77"},"Title":"The Pianist","Description":"Based on the autobiographical book The Pianist, a Holocaust memoir by the Polish-Jewish pianist and composer Wladyslaw Szpilman, a Holocaust survivor.","Genre":{"Name":"Drama","Description":"Drama is a genre of narrative fiction (or semi-ficiton) intended to be more serious than humorous in tone."},"Director":{"Name":"Roman Polanksi","Bio":"Roman Polanski is a French-Polish film director, producer, writer, and actor. Since 1978, Polanski has been a fugitive from the U.S criminal justice system.","Birth":"1933-08-18"},"ImagePath":"pianist.png","Featured":true}
{"_id":{"$oid":"5e45c539a86becc380e04d78"},"Title":"Tekkonkinkreet","Description":"The tale of a pair of orphans who attempt to prevent the Yakuza and their assorted violent and corrupt allies from taking over their city.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Michael Arias","Bio":"Though Arias has worked variously as visual effects artist, animation software developer, and producer, he is best known for his directorial debut, the anime feature Tekkonkinkreet.","Birth":"1968-02-02"},"ImagePath":"tekkon.png","Featured":true}
{"_id":{"$oid":"5e45c680a86becc380e04d79"},"Title":"Shaolin Soccer","Description":"A former Shaolin monk reunites his five brothers, years after their masters death, to apply their superhuman martial arts skills to play football and bring Shaolin kung fu to the masses.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Stephen Chow","Bio":"Stephen Chow Sing Chi is a Hong Kong film director, actor, producer, political adviser of the Chinese Peoples Political Consultative Conference and martial artist.","Birth":"1962-06-22"},"ImagePath":"shaolin.png","Featured":false}
{"_id":{"$oid":"5e45cafca86becc380e04d7a"},"Title":"Dr. Strangelove","Description":"The story concerns an unhinged United States Air Force general who orders a first strike nuclear attack on the Soviet Union. It follows the President of the United States, his advisors, the Joint Chiefs of Staff, and a Royal Air Force (RAF) officer as they try to recall the bombers to prevent a nuclear apocalypse.","Genre":{"Name":"Black Comedy","Description":"Black comedy, also known as black humor, dark comedy, dark humor or gallows humor, is a comic style that makes light of subject matter that is generally considered taboo, particularly subjects that are normally considered serious or painful to discuss."},"Director":{"Name":"Stanley Kubrick","Bio":"Stanley Kubrick was an American film director, screenwriter, and producer. He is frequently cited as one of the most influential filmmakers in cinematic history.","Birth":"1928-07-26"},"ImagePath":"strange.png","Featured":false}
{"_id":{"$oid":"5e45cc51a86becc380e04d7b"},"Title":"2 Days in the Valley","Description":"Dosmo Pizzo (Danny Aiello), an ordinary guy, finds himself involved in a murder-for-hire scheme. He is betrayed by his partner, the strangely serene Lee Woods (James Spader), who leaves him for dead","Genre":{"Name":"Drama","Description":"Drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"John Herzfeld","Bio":"John Herzfeld is an American film and television director, screenwriter, actor and producer. His feature film direction credits include Two of a Kind, 2 Days in the Valley, 15 Minutes and the Death and Life of Bobby Z.","Birth":"1947-04-15"},"ImagePath":"valley.png","Featured":false}
{"_id":{"$oid":"5e46164598cd9b48a9446b7b"},"Title":"Big Fish","Description":"When Edward Bloom (Albert Finney) becomes ill, his son, William (Billy Crudup) travels with him. William has a strained relationship with Edward because his father has always told exaggerated stories about his life, and William thinks hes never really told the truth. Even on his deathbed, Edward recounts fantastical anecdotes. When William, who is a journalist, starts to investigate his fathers tales, he begins to understand the man and his penchant for storytelling.","Genre":{"Name":"Fantasy","Description":"Fantasy films often have an element of magic, myth, wonder, escapism, and the extraordinary."},"Director":{"Name":"Tim Burton","Bio":"Timothy Walter Burton is an American director, producer, artist, writer, and animator. He is known for his dark, gothic, and eccentric horror and fantasy films.","Birth":"1947-04-15"},"ImagePath":"bigfish.png","Featured":false,"Bio":"American director, producer, artist, writer, and animator. He is known for his dark, gothic, and eccentric horror and fantasy films."}
{"_id":{"$oid":"5e46188a98cd9b48a9446b7c"},"Title":"Very Bad Things","Description":"Kyle Fisher (Jon Favreau) heads to Las Vegas for a bachelor party with four friends. When one of them accidentally kills a hired stripper and a security guard finds the body, unstable Boyd (Christian Slater) kills the guard to keep him from calling the cops, then organizes the group to dispose of the corpses. Back home, Kyle is troubled and has difficulty hiding his worries from his fiancee (Cameron Diaz). Meanwhile, to ensure his own saftey, Boyd begins killing the others.","Genre":{"Name":"Black Comedy","Description":"Black comedy, also known as black humor, dark comedy, dark humor or gallows humor, is a comic style that makes light of subject matter that is generally considered taboo, particularly subjects that are normally considered serious or painful to discuss."},"Director":{"Name":"Peter Berg","Bio":"Peter Berg is an American director, producer, writer, and actor. His directorial film works include the black comedy Very Bad Things, the action comedy The Rundown, the sports drama Friday Night Lights.","Birth":"1964-03-11"},"ImagePath":"badthings.png","Featured":false}
{"_id":{"$oid":"5e46e804bcf120d45cbdc038"},"Title":"Garden State","Description":"After many years away, television bit part actor Andrew Largeman (Zach Braff) returns to his small home town in New Jersey to attend his mothers funeral. There he is confronted by various aspects of the life he left behind, including his overbearing father (Ian Holm). Largeman also meets compulsive liar and amateur musician Sam (Natalie Portman), with whom he feels an immediate connection. Together with several other figures from his past, Largeman heals old wounds and forges new friendships.","Genre":{"Name":"Drama","Description":"Drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Zach Braff","Bio":"Zachary Isreal Braff is an American actor, director, screenwriter and producer. He is best known for his role as J.D on the television series Scrubs, for which he was nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series in 2005 and for three Golden Globe Awards from 2005 to 2007.","Birth":"1975-04-06"},"ImagePath":"garden.png","Featured":false}
{"_id":{"$oid":"5e46e96abcf120d45cbdc039"},"Title":"Sweeney Todd","Description":"Evil Judge Turpin (Alan Rickman) lusts for the beautiful wife of a London barber (Johnny Depp) and transports him to Australia for a crime he did not commit. Returning after 15 years and calling himself Sweeney Todd, the now-mad man vows revenge, applying his razor to unlucky customers and shuttling the bodies down to Mrs.Lovett (Helena Bonham Carter), who uses them in her meat-pie shop. Though many fal to his blade, he will not be satisfied until he slits Turpins throat.","Genre":{"Name":"Drama","Description":"Drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Tim Burton","Bio":"Timothy Walter Burton is an American director, producer, artist, writer, and animator. He is known for his dark, gothic, and eccentric horror and fantasy films.","Birth":"1975-04-06"},"ImagePath":"sweeney.png","Featured":false,"Bio":"American director, producer, artist, writer, and animator. He is known for his dark, gothic, and eccentric horror and fantasy films."}
